spec/fixtures/services/ad_group_ad_service/mutate_add-req.xml

<!-- Post to 'https://adwords-sandbox.google.com/api/adwords/cm/v200909/AdGroupAdService' -->
<?xml version="1.0" encoding="utf-8" ?>      <env:Envelope
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns="https://adwords.google.com/api/adwords/cm/v200909"
  xmlns:s="https://adwords.google.com/api/adwords/cm/v200909">
  <env:Header>
    <s:RequestHeader env:mustUnderstand="0">
      <authToken>***censured***<authToken>
      <userAgent>Sem4r Adwords Ruby Client Library (http://github.com/sem4r/sem4r)</userAgent>
      <developerToken>***censured***<developerToken>
      <clientEmail>client_1+sem4ruby@gmail.com</clientEmail>
    </s:RequestHeader>
  </env:Header><env:Body>
    <mutate xmlns="https://adwords.google.com/api/adwords/cm/v200909">
      <operations xsi:type="AdGroupAdOperation">
        <operator>ADD</operator>
        <operand>
          <adGroupId>3060217927</adGroupId>
          <ad xsi:type="TextAd">
            <url>http://www.pluto.com</url>
            <displayUrl>www.Pluto.com</displayUrl>
            <headline>Vieni da noi</headline>
            <description1>vieni da noi</description1>
            <description2>arivieni da noi</description2>
          </ad>
          <status>ENABLED</status>
        </operand>
      </operations>
    </mutate>
  </env:Body>
</env:Envelope>

